Revit 2027 API
RebarCoupler.CouplerLinkTwoBars Method
 returns true if the coupler sits on two rebar and false otherwise
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CouplerLinkTwoBars()
Public Function CouplerLinkTwoBars As Boolean
public:
bool CouplerLinkTwoBars()
member CouplerLinkTwoBars : unit -> bool
Return Value
Boolean
See Also
Reference
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace